# Задача №19.  Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо,  K – положительное число.
# Input:   [1, 2, 3, 4, 5] k = 3
# Output:  [3, 4, 5, 1, 2]

numbers = [1, 2, 3, 4, 5, 6, 7, 8]
k = 3
print(f'{numbers} k = {k}')

# print(f'{numbers[-k:] + numbers[:-k] = }')
print(f'{numbers}')